"""
Задание 8: Двууровневый кортеж. (бонусное)
УСЛОВИЕ:
Фрагмент кода, который принимает кортеж любых чисел и модифицирует его
в кортеж кортежей по два элемента (парами).
Пример:
(1,4,8,6,3,7,1) >> ((1,4),(8,6),(3,7),(1,))
"""


def two_level_tuple(tpl):
	"""
	Задание 8: Двууровневый кортеж. (бонусное)
	УСЛОВИЕ:
	Фрагмент кода, который принимает кортеж любых чисел и модифицирует его
	в кортеж кортежей по два элемента (парами).
	Пример:
	(1,4,8,6,3,7,1) >> ((1,4),(8,6),(3,7),(1,))
	"""
	d = {}
	for i, elm in enumerate(tpl):
		if i%2==0:
			indx = elm
		else:
			d[indx] = elm
	list_tuple = list(d.items())
	list_tuple_all = list_tuple + [tpl[-1:]]
	return tuple(list_tuple_all)



if __name__ == "__main__":
	print (two_level_tuple.__doc__)
	assert two_level_tuple((1,4,8,6,3,7,1)) == ((1,4),(8,6),(3,7),(1,))
	print("Ok!")